; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v9 ?v13)
             (pred_9 ?v8 ?v3)
             (pred_8 ?v9 ?v3)
             (pred_3 ?v12 ?v9 )
	     (pred_5 ?v9)
             (pred_6 ?v7)
             (pred_12 ?v8)
             (pred_2 ?v3)
             (pred_1 ?v9)
             (pred_7 ?v8)
             (pred_10 ?v9)
             (pred_4 ))



(:action op_5
:parameters (?v2 ?v5 ?v1 ?v4)
:precondition (and (pred_6 ?v2) (pred_6 ?v5) (pred_12 ?v1) (pred_2 ?v4)
          (pred_11 ?v2 ?v5) (pred_9 ?v1 ?v4)
                   (pred_8 ?v5 ?v4) (pred_5 ?v2) 
                   (pred_1 ?v5) (pred_7 ?v1))
:effect (and  (pred_10 ?v5) (not (pred_1 ?v5))))


(:action op_3
:parameters (?v2 ?v11)
:precondition (and (pred_6 ?v2) (pred_6 ?v11)
               (pred_5 ?v2) (pred_11 ?v2 ?v11) (pred_10 ?v11))
:effect (and (pred_5 ?v11) (not (pred_5 ?v2))))

(:action op_2
:parameters (?v2 ?v1)
:precondition (and (pred_6 ?v2) (pred_12 ?v1) 
                  (pred_5 ?v2) (pred_3 ?v1 ?v2) (pred_4 ))
:effect (and (pred_7 ?v1)
   (not (pred_3 ?v1 ?v2)) (not (pred_4 ))))


(:action op_4
:parameters (?v2 ?v10 ?v6)
:precondition (and (pred_6 ?v2) (pred_12 ?v10) (pred_12 ?v6)
                  (pred_5 ?v2) (pred_7 ?v6) (pred_3 ?v10 ?v2))
:effect (and (pred_7 ?v10) (pred_3 ?v6 ?v2)
        (not (pred_7 ?v6)) (not (pred_3 ?v10 ?v2))))

(:action op_1
:parameters (?v2 ?v1)
:precondition (and (pred_6 ?v2) (pred_12 ?v1) 
                  (pred_5 ?v2) (pred_7 ?v1))
:effect (and (pred_4 ) (pred_3 ?v1 ?v2) (not (pred_7 ?v1)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_03 obj_10 obj_09 obj_04 obj_01 obj_05 obj_08 obj_25 obj_31 obj_06 obj_28 obj_30 obj_22 obj_16 obj_18 obj_26 obj_14 obj_19 obj_29 obj_17 obj_24 obj_23 obj_13 obj_12 obj_11
    obj_20 obj_02 obj_32
    obj_07 obj_15 obj_21 obj_27
    )

    (:init
       (pred_4)

       (pred_6 obj_03)
       (pred_6 obj_10)
       (pred_6 obj_09)
       (pred_6 obj_04)
       (pred_6 obj_01)
       (pred_6 obj_05)
       (pred_6 obj_08)
       (pred_6 obj_25)
       (pred_6 obj_31)
       (pred_6 obj_06)
       (pred_6 obj_28)
       (pred_6 obj_30)
       (pred_6 obj_22)
       (pred_6 obj_16)
       (pred_6 obj_18)
       (pred_6 obj_26)
       (pred_6 obj_14)
       (pred_6 obj_19)
       (pred_6 obj_29)
       (pred_6 obj_17)
       (pred_6 obj_24)
       (pred_6 obj_23)
       (pred_6 obj_13)
       (pred_6 obj_12)
       (pred_6 obj_11)
       (pred_2 obj_20)
       (pred_2 obj_02)
       (pred_2 obj_32)
       (pred_12 obj_07)
       (pred_12 obj_15)
       (pred_12 obj_21)
       (pred_12 obj_27)

       (pred_11 obj_03 obj_05)
       (pred_11 obj_03 obj_10)
       (pred_11 obj_10 obj_08)
       (pred_11 obj_10 obj_09)
       (pred_11 obj_10 obj_03)
       (pred_11 obj_09 obj_25)
       (pred_11 obj_09 obj_04)
       (pred_11 obj_09 obj_10)
       (pred_11 obj_04 obj_31)
       (pred_11 obj_04 obj_01)
       (pred_11 obj_04 obj_09)
       (pred_11 obj_01 obj_06)
       (pred_11 obj_01 obj_04)
       (pred_11 obj_05 obj_28)
       (pred_11 obj_05 obj_08)
       (pred_11 obj_05 obj_03)
       (pred_11 obj_08 obj_30)
       (pred_11 obj_08 obj_25)
       (pred_11 obj_08 obj_10)
       (pred_11 obj_08 obj_05)
       (pred_11 obj_25 obj_22)
       (pred_11 obj_25 obj_31)
       (pred_11 obj_25 obj_09)
       (pred_11 obj_25 obj_08)
       (pred_11 obj_31 obj_16)
       (pred_11 obj_31 obj_06)
       (pred_11 obj_31 obj_04)
       (pred_11 obj_31 obj_25)
       (pred_11 obj_06 obj_18)
       (pred_11 obj_06 obj_01)
       (pred_11 obj_06 obj_31)
       (pred_11 obj_28 obj_26)
       (pred_11 obj_28 obj_30)
       (pred_11 obj_28 obj_05)
       (pred_11 obj_30 obj_14)
       (pred_11 obj_30 obj_22)
       (pred_11 obj_30 obj_08)
       (pred_11 obj_30 obj_28)
       (pred_11 obj_22 obj_19)
       (pred_11 obj_22 obj_16)
       (pred_11 obj_22 obj_25)
       (pred_11 obj_22 obj_30)
       (pred_11 obj_16 obj_29)
       (pred_11 obj_16 obj_18)
       (pred_11 obj_16 obj_31)
       (pred_11 obj_16 obj_22)
       (pred_11 obj_18 obj_17)
       (pred_11 obj_18 obj_06)
       (pred_11 obj_18 obj_16)
       (pred_11 obj_26 obj_24)
       (pred_11 obj_26 obj_14)
       (pred_11 obj_26 obj_28)
       (pred_11 obj_14 obj_23)
       (pred_11 obj_14 obj_19)
       (pred_11 obj_14 obj_30)
       (pred_11 obj_14 obj_26)
       (pred_11 obj_19 obj_13)
       (pred_11 obj_19 obj_29)
       (pred_11 obj_19 obj_22)
       (pred_11 obj_19 obj_14)
       (pred_11 obj_29 obj_12)
       (pred_11 obj_29 obj_17)
       (pred_11 obj_29 obj_16)
       (pred_11 obj_29 obj_19)
       (pred_11 obj_17 obj_11)
       (pred_11 obj_17 obj_18)
       (pred_11 obj_17 obj_29)
       (pred_11 obj_24 obj_23)
       (pred_11 obj_24 obj_26)
       (pred_11 obj_23 obj_13)
       (pred_11 obj_23 obj_14)
       (pred_11 obj_23 obj_24)
       (pred_11 obj_13 obj_12)
       (pred_11 obj_13 obj_19)
       (pred_11 obj_13 obj_23)
       (pred_11 obj_12 obj_11)
       (pred_11 obj_12 obj_29)
       (pred_11 obj_12 obj_13)
       (pred_11 obj_11 obj_17)
       (pred_11 obj_11 obj_12)
       (pred_1 obj_30)
       (pred_1 obj_03)
       (pred_1 obj_14)
       (pred_1 obj_10)
       (pred_8  obj_30 obj_20)
       (pred_8  obj_03 obj_02)
       (pred_8  obj_14 obj_32)
       (pred_8  obj_10 obj_20)
       (pred_10 obj_09)
       (pred_10 obj_04)
       (pred_10 obj_01)
       (pred_10 obj_05)
       (pred_10 obj_08)
       (pred_10 obj_25)
       (pred_10 obj_31)
       (pred_10 obj_06)
       (pred_10 obj_28)
       (pred_10 obj_22)
       (pred_10 obj_16)
       (pred_10 obj_18)
       (pred_10 obj_26)
       (pred_10 obj_19)
       (pred_10 obj_29)
       (pred_10 obj_17)
       (pred_10 obj_24)
       (pred_10 obj_23)
       (pred_10 obj_13)
       (pred_10 obj_12)
       (pred_10 obj_11)

       (pred_9  obj_07 obj_20)
       (pred_9  obj_15 obj_02)
       (pred_9  obj_21 obj_32)
       (pred_9  obj_27 obj_02)
       (pred_3 obj_07 obj_01)
       (pred_3 obj_15 obj_23)
       (pred_3 obj_21 obj_12)
       (pred_3 obj_27 obj_22)
       (pred_5 obj_08)
    )

    (:goal (and
       (pred_3 obj_21 obj_25)
       (pred_3 obj_27 obj_18)
    ))
(:constraints
  (always (not (pred_5 obj_29)))
)
)

; plan
1. (op_3 obj_08 obj_25)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_25)
   goals met: 0 of 2
2. (op_3 obj_25 obj_22)
   deleted: (pred_5 obj_25)
   added: (pred_5 obj_22)
   goals met: 0 of 2
3. (op_3 obj_22 obj_19)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_19)
   goals met: 0 of 2
4. (op_3 obj_19 obj_13)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_13)
   goals met: 0 of 2
5. (op_3 obj_13 obj_12)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_12)
   goals met: 0 of 2
6. (op_2 obj_12 obj_21)
   deleted: (pred_3 obj_21 obj_12) (pred_4)
   added: (pred_7 obj_21)
   goals met: 0 of 2
7. (op_3 obj_12 obj_13)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_13)
   goals met: 0 of 2
8. (op_3 obj_13 obj_19)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_19)
   goals met: 0 of 2
9. (op_3 obj_19 obj_22)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_22)
   goals met: 0 of 2
10. (op_3 obj_22 obj_25)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_25)
   goals met: 0 of 2
11. (op_1 obj_25 obj_21)
   deleted: (pred_7 obj_21)
   added: (pred_4) (pred_3 obj_21 obj_25)
   goals met: 1 of 2
12. (op_3 obj_25 obj_22)
   deleted: (pred_5 obj_25)
   added: (pred_5 obj_22)
   goals met: 1 of 2
13. (op_2 obj_22 obj_27)
   deleted: (pred_3 obj_27 obj_22) (pred_4)
   added: (pred_7 obj_27)
   goals met: 1 of 2
14. (op_3 obj_22 obj_16)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_16)
   goals met: 1 of 2
15. (op_3 obj_16 obj_18)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_18)
   goals met: 1 of 2
16. (op_1 obj_18 obj_27)
   deleted: (pred_7 obj_27)
   added: (pred_4) (pred_3 obj_27 obj_18)
   goals met: 2 of 2
